04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/film/cylinder/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 1e5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    film
    {
        type            fixedFluxPressure;
    }

    "(sides|frontAndBack)"
    {
        type            fixedFluxPressure;
    }

    top
    {
        type            prghTotalPressure;
        p0              $internalField;
    }
}

// ************************************************************************* //
