04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/film/cylinder/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s fluid blockMesh -region fluid

runApplication extrudeToRegionMesh -region fluid

runApplication foamMultiRun

#------------------------------------------------------------------------------
